// на складе завода имеется некоторое количество деталей. Детали различаются материалом(сталь железл медь дерево пластмас алмений и тд) назначением (комплектующие инструкменты) весом и стоимостью. ВЕс и стоимость задаются случайным образом. Создать коллекцю деталей. Если сстоимость детали привышает заданное значит,то выбрсить свое созданное исключение. обеспечить сортировку по весу по убыванию и по стоимости по возрастанию нажатием соответствующих кнопок. Кнопки расположить в верхней части экрана.
// начинаю
public class Main {

}

